In [2]:
import pandas as pd
import numpy as np

In [5]:
file_name = 'data_with_nan.csv'

df = pd.read_csv(file_name)   # 讀入指定csv檔案

In [6]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [7]:
columns = ["col1", "col2", "col3"]
data = [
    ["test1", 13, None],
    ["test2", 44, "aaa"],
    ["test3", None, None],
    [None, None, None]
]
df2 = pd.DataFrame(data=data, columns=columns)   # 如果欄位都是數值，空值會是float; 如果欄位有字串，空值會是None
df2

    col1  col2  col3
0  test1  13.0  None
1  test2  44.0   aaa
2  test3   NaN  None
3   None   NaN  None

In [8]:
df['col1'][5] # 第五個值為空值

nan

In [9]:
type(df['col1'][5])

float

In [11]:
df2['col1'][3]  # python裡面的空值，不會印出資料

In [12]:
type(df2['col1'][3]) # python空值預設型別跟pandas不同

NoneType

In [13]:
columns = ["col1", "col2", "col3"]
data = [
    ["test1", 13, np.nan],     # 利用numpy製作空值，對於pandas較友善
    ["test2", 44, "aaa"],
    ["test3", np.nan, np.nan],
    [np.nan, np.nan, np.nan]
]
df3 = pd.DataFrame(data=data, columns=columns)
df3

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN

In [14]:
# 填補空值
df3.fillna('abc')  # 重新宣告後才會真的更新

    col1  col2 col3
0  test1  13.0  abc
1  test2  44.0  aaa
2  test3   abc  abc
3    abc   abc  abc

In [15]:
# 指定填補空值的位置
df3['col1'].fillna('test')  # 重新宣告後才會真的更新

0    test1
1    test2
2    test3
3     test
Name: col1, dtype: object

In [16]:
# 參照前一位數值，填補空值
df3['col2'].fillna(method='ffill')

0    13.0
1    44.0
2    44.0
3    44.0
Name: col2, dtype: float64

In [17]:
# 參照前一位數值，填補空值
df3['col3'].fillna(method='ffill')

0    NaN
1    aaa
2    aaa
3    aaa
Name: col3, dtype: object